package com.example.qwer_test_kt.gomin.wiget

data class Song(
    val title: String,
    val lyrics: String
)

val songList = listOf(
    Song(
        title = "Discord",
        lyrics = "딱 하나만 물어볼게 넌\n" +
                "완벽이란 게 있다고 생각해?\n" +
                "조금은 어색한 하모니라 해도\n" +
                "그것도 그것대로 꽤 멋지잖아\n" +
                "누군간 나를 보고 수근대겠지만\n" +
                "그런 무례함은 도로 넣어둬요\n" +
                "취향은 존중해 그치만 이런 날\n" +
                "밀어내긴 쉽지 않을걸\n" +
                "무대 위 춤을 추는 d선 상의 아리아\n" +
                "불협화음도 괜찮아 뭐 문제가 되려나\n" +
                "모두 내게 반해버려도 난 몰라요\n" +
                "무지개 멜로디는 저 하늘을 날아\n" +
                "이것도 나야 나야 나\n" +
                "이런 내가 궁금하니\n" +
                "뭘 해도 나야 나야 나\n" +
                "들어줘 나의 Discord\n" +
                "주사위는 던져졌고\n" +
                "이젠 눈앞에 온 거야 my turn\n" +
                "조금 뻔뻔해도 눈감아줄래요\n" +
                "작은 소동을 부리는 game changer\n" +
                "모두가 나를 사랑할 순 없겠지만\n" +
                "그렇대도 난 실망 따윈 안 해요\n" +
                "겸손은 어려워 그치만 이런 날\n" +
                "미워하긴 쉽지 않을걸\n" +
                "무대 위 춤을 추는 d선 상의 아리아\n" +
                "불협화음도 괜찮아 뭐 문제가 되려나\n" +
                "모두 내게 반해버려도 난 몰라요\n" +
                "무지개 멜로디는 저 하늘을\n" +
                "사실 조금은 떨렸다랄까 두근두근대\n" +
                "지금 난 자꾸 자꾸 듣고 싶어\n" +
                "내가 너의 최애라고 말해\n" +
                "무대 위 춤을 추는 d선 상의 아리아\n" +
                "불협화음도 괜찮아 뭐 문제가 되려나\n" +
                "모두 내게 반해버려도 난 몰라요\n" +
                "무지개 멜로디는 저 하늘을 날아\n" +
                "이것도 나야 나야 나\n" +
                "이런 내가 궁금하니\n" +
                "뭘 해도 나야 나야 나\n" +
                "들어줘 나의 Discord"
    ),
    Song(
        title = "지구 정복",
        lyrics = "두 손에 쥔 이 기타와\n" +
                "심장박동을 맞추자\n" +
                "이 템포를 기억해 둬\n" +
                "우리가 가는 길을 잃지 않게\n" +
                "시작선 위로 피어난 긴장도\n" +
                "우리를 막진 못해\n" +
                "(두근대는 심장 소리, 이건 우리의 신호탄!)\n" +
                "시간이 충분할지 모르겠어\n" +
                "이대론 무리지\n" +
                "(좀 더 속도를 내볼까, 더 이상은 미룰 수 없어)\n" +
                "여섯 줄의 울림\n" +
                "그 위로 모든 진심을 담아본다\n" +
                "준비는 끝\n" +
                "이제부터 시작이야\n" +
                "전속력으로 돌진해 지구 저 끝까지\n" +
                "이 한숨에 전부를 걸어볼 테니까\n" +
                "함성소리 팡! 터질 때까지\n" +
                "이 노래를 부를 거야\n" +
                "우리 목표는\n" +
                "지구! 정복!\n" +
                "더 크게 볼륨을 올려 줘\n" +
                "지구! 정복!\n" +
                "온 세상이 떠들썩하게\n" +
                "평범히 다가가는 법은 몰라\n" +
                "그대론 안 하지\n" +
                "(좀 더 과감해 볼까, 겁이라는 건 다 버렸어)\n" +
                "적막한 이 세상에\n" +
                "스피커를 켠 다음\n" +
                "고요하게 잠든 이 도시를\n" +
                "다시 뜨겁게 연주해보는 거야\n" +
                "잘 들어봐\n" +
                "이제부터 시작이야\n" +
                "전속력으로 돌진해 지구 저 끝까지\n" +
                "이 한숨에 전부를 걸어볼 테니까\n" +
                "함성소리 팡! 터질 때까지\n" +
                "이 노래를 부를 거야\n" +
                "우리 목표는\n" +
                "시작했으니 끝을 보자고\n" +
                "포기 따윈 계획엔 없어\n" +
                "다들 들어줘 좀 더\n" +
                "멋지게 울려라 기타!\n" +
                "가보 가보 자\n" +
                "(저 멀리 더)\n" +
                "라랄 라랄 라\n" +
                "(노래해 더)\n" +
                "말했다시피 뭐! 우리 목표는 말야!\n" +
                "(지구 정복이다)\n" +
                "전속력으로 돌진해 지구 저 끝까지\n" +
                "이 한숨에 전부를 걸어볼 테니까\n" +
                "함성소리 팡! 터질 때까지\n" +
                "이 노래를 부를 거야\n" +
                "우리 목표는\n" +
                "지구! 정복!\n" +
                "더 크게 볼륨을 올려 줘\n" +
                "지구! 정복!\n" +
                "온 세상이 떠들썩하게\n" +
                "지구! 정복!\n" +
                "더 크게 볼륨을 올려 줘\n" +
                "지구! 정복!\n" +
                "온 세상이 떠들썩하게"
    ),
    Song(
        title = "별의 하모니",
        lyrics = "조용하게 비춘 별 하나\n" +
                "인사를 건네는 듯해\n" +
                "긴 시간 속 매일 그 자리에\n" +
                "어쩌면 아득히 멀리\n" +
                "가 있기에 소중한 거라\n" +
                "외면하고 있었던 나인데\n" +
                "발걸음과 발걸음 사이\n" +
                "쌓여만 간 망설임과 무리란 말\n" +
                "네가 내 곁에 와주던\n" +
                "순간 전부 사라졌어\n" +
                "소란하게 내린 별의 빛\n" +
                "그 틈 사이 사이로\n" +
                "다시 투명히 비친 눈부신\n" +
                "나만의 꿈의 조각들\n" +
                "너와 함께라는 이유로\n" +
                "운명을 믿어 난\n" +
                "눈 앞에 펼쳐진 미랠 향해 인사를 해\n" +
                "빛나는 별처럼\n" +
                "(Ah, ah, ah)\n" +
                "저 빛나는 별처럼\n" +
                "(Ah, ah, ah)\n" +
                "난 아이처럼 혼자선 꼭\n" +
                "서투르고 헤매는 걸\n" +
                "잡은 두 손의 온기로\n" +
                "좀 더 멀리 데려가 줘\n" +
                "소란하게 내린 별의 빛\n" +
                "그 틈 사이 사이로\n" +
                "다시 투명히 비친 눈부신\n" +
                "나만의 꿈의 조각들\n" +
                "너와 함께라는 이유로\n" +
                "운명을 믿어 난\n" +
                "눈 앞에 펼쳐진 미랠 향해 인사를 해\n" +
                "빛나는 별처럼\n" +
                "내 맘을 다 아는 듯이\n" +
                "지어주는 웃음이\n" +
                "푸른 새벽 같아서\n" +
                "뭐든 가능할 것 같아\n" +
                "가장 빛나는 시작도\n" +
                "찬란해질 내일도\n" +
                "이제 울지 않아\n" +
                "너와 나로 이어진 별자리\n" +
                "우리만의 하모니\n" +
                "아주 길고 긴 시간 지나도\n" +
                "반짝일 우릴 테니까\n" +
                "까만 어둠이 또 온대도\n" +
                "두렵지 않아 난\n" +
                "놓치지 않도록 너의 손을 잡아 줄게\n" +
                "빛나는 별처럼\n" +
                "(Ah, ah, ah)\n" +
                "저 빛나는 별처럼\n" +
                "(Ah, ah, ah)\n" +
                "저 빛나는 별처럼\n" +
                "(Ah, ah, ah)"
    ),
    Song(
        title = "고민 중독",
        lyrics = "One! Two! Q! W! E! R!\n" +
                "\n" +
                "어떤 인사가 괜찮을까 천 번쯤 상상해 봤어\n" +
                "근데 오늘도 천 번 하고 한 번 더 고민 중\n" +
                "\n" +
                "막상 네 앞에 서니 꽁꽁 얼어버렸다\n" +
                "숨겨왔던 나의 맘 절반의 반도 주지를 못했어\n" +
                "\n" +
                "아, 아, 아직은\n" +
                "준비가 안됐다구요\n" +
                "소용돌이쳐 어지럽다구\n" +
                "\n" +
                "쏟아지는 맘을 멈출 수가 없을까?\n" +
                "너의 작은 인사 한마디에 요란해져서\n" +
                "네 맘의 비밀번호 눌러 열고 싶지만\n" +
                "너를 고민고민해도 좋은 걸 어쩌니\n" +
                "\n" +
                "거울 앞에서 새벽까지 연습한 인사가\n" +
                "손을 들고 웃는 얼굴을 하고서 고개를 숙였다\n" +
                "\n" +
                "아, 아, 아직도 준비가 안됐나 봐요\n" +
                "소용돌이쳐 어지럽다구\n" +
                "\n" +
                "쏟아지는 맘을 멈출 수가 없을까?\n" +
                "너의 작은 인사 한마디에 요란해져서\n" +
                "네 맘의 비밀번호 눌러 열고 싶지만\n" +
                "너를 고민고민해도 좋은 걸\n" +
                "\n" +
                "이러지도 저러지도 못하는데\n" +
                "속이 왈칵 뒤집히고\n" +
                "이쯤 왔으면 눈치 챙겨야지\n" +
                "날 봐달라구요!\n" +
                "\n" +
                "좋아한다 너를 좋아한다 좋아해\n" +
                "\n" +
                "너를 많이 많이 좋아한단 말이야\n" +
                "벅차오르다 못해 내 맘이 쿡쿡 아려와\n" +
                "두 번은 말 못 해 너 지금 잘 들어봐\n" +
                "매일 고민하고 연습했던 말\n" +
                "좋아해"
    ),
    Song(
        title = "내이름 맑음",
        lyrics = "어쩌다 고작 그 마음도 못 참고\n" +
                "멍청하게 다 던졌는지\n" +
                "\n" +
                "뭔가 들켜 버린 것 같아\n" +
                "표정을 보니 말이야\n" +
                "나도 티가 나버린 고백에\n" +
                "얼마나 놀랐는지 몰라\n" +
                "\n" +
                "매일 치는 장난에도 두근댔고\n" +
                "오늘도 몇 번이고 떨렸지만\n" +
                "약속했어 날 안아줘 좀 알아줘\n" +
                "이건 꿈에서만 하기야\n" +
                "\n" +
                "무심코 던진 니 말에 하루 종일 설레어 간직했다\n" +
                "아무도 못 보게 일기장에 적어 단단히 잠궜었는데\n" +
                "\n" +
                "어쩌다 고작 그 마음도 못 참고\n" +
                "멍청하게 다 던졌는지\n" +
                "꾹꾹 참고 또 꼭꼭 숨겨서\n" +
                "이제까지 잘해 왔잖아\n" +
                "\n" +
                "그러다 고작 울음도 못 참고\n" +
                "괜찮다 말하며 두 눈은\n" +
                "퉁퉁 붓고 코맹맹이가 되어도 난\n" +
                "내일은 맑음\n" +
                "\n" +
                "예전처럼 옆에서 밥 먹어도\n" +
                "우연히 눈이 살짝 마주쳐도 걱정 마\n" +
                "날 안아줘 아니 사랑해줘\n" +
                "이건 꿈에서만 하니까\n" +
                "\n" +
                "무심코 던진 니 말에 하루 종일 설레어 간직했다\n" +
                "아무도 못 보게 꼬깃꼬깃 구겨 씹어 다 삼켰었는데\n" +
                "\n" +
                "어쩌다 고작 그 마음도 못 참고\n" +
                "멍청하게 다 던졌는지\n" +
                "꾹꾹 참고 또 꼭꼭 숨겨서\n" +
                "이제까지 잘 해 왔잖아\n" +
                "\n" +
                "그러다\n" +
                "고작 울음도 못 참고\n" +
                "괜찮다 말하며 두 눈은\n" +
                "퉁퉁 붓고 코맹맹이가 되어도 난\n" +
                "\n" +
                "사실 나\n" +
                "아주 오래 울 것 같아\n" +
                "고작 친구도 못 되니까\n" +
                "툭툭 털고 활짝 웃을 만큼\n" +
                "나는 그리 강하지가 않아\n" +
                "\n" +
                "그러다\n" +
                "고작 사랑이 뭐라고\n" +
                "괜찮다 말하는 날까지\n" +
                "꾹꾹 참고 또 일기나 쓰고 있어 나\n" +
                "내 이름 맑음"
    ),
    Song(
        title = "눈물 참기",
        lyrics = "맑은 하늘에 비 내리는 날\n" +
                "내 마음과 정말 닮아서 이상하네요\n" +
                "\n" +
                "한 방울 한 방울씩 떨어지는 비가\n" +
                "점점 맘에 차서 숨쉬기가 힘들 것 같아요\n" +
                "\n" +
                "세상이 아직은 무섭고\n" +
                "여전히 넘어지는 게\n" +
                "아직은 너무 어려운가 봐\n" +
                "\n" +
                "눈물 멈추는 법을 몰라요\n" +
                "차디차고 너무 아파요\n" +
                "괜찮다는 말은 다 거짓말\n" +
                "\n" +
                "비가 내리는 여기 남겨져\n" +
                "혼자 울고 싶지 않아요\n" +
                "알려주세요\n" +
                "눈물을 참는 방법\n" +
                "\n" +
                "하나둘 한숨 위로 차오른 슬픔이\n" +
                "이제는 밖으로 다 쏟아져 넘칠 것 같아요\n" +
                "\n" +
                "말해줘 다 잘될 거라고\n" +
                "도와줘 겁 많은 나라서\n" +
                "날 믿을 수 없을 땐, 어떡해야 하나요\n" +
                "누구라도 말해줘요\n" +
                "넘어지는 게 아직 너무 어려운가 봐\n" +
                "\n" +
                "눈물 멈추는 법을 몰라요\n" +
                "차디차고 너무 아파요\n" +
                "괜찮다는 말은 다 거짓말\n" +
                "\n" +
                "비가 내리는 여기 남겨져\n" +
                "혼자 울고 싶지 않아요\n" +
                "알려주세요\n" +
                "눈물을 참는 방법\n" +
                "\n" +
                "내리던 비가 그치고 나면\n" +
                "내일이 꼭 올 테니까\n" +
                "\n" +
                "눈물 멈추는 법을 몰라도\n" +
                "이런 내가 자꾸 미워도\n" +
                "잠시 멈춰 눈물을 삼키고\n" +
                "\n" +
                "일기장 속에 적어 놓았던\n" +
                "“잘 지내나요?”란 말 위에\n" +
                "적어봐요\n" +
                "“이젠 잘 지낼게요”"
    ),
    Song(
        title = "검색어는 QWER",
        lyrics = "간만에 톡하고 검색해 본 my name\n" +
                "자꾸만 꾹 하고 확인해도, 글쎄?\n" +
                "이게 딱 맞는 걸까? 저게 정답인 걸까?\n" +
                "진짜 어렵단 말야\n" +
                "Tap, tap, tap, tap 이런 말들과\n" +
                "Tap, tap, tap, tap 저런 말 사이에\n" +
                "안 볼래, 눈치코치, 예측 불가해 that's me\n" +
                "난 나일 뿐인걸\n" +
                "내 맘을 검색해 정답을 찾아볼래\n" +
                "내가 정한 내 모습들로 (내 맘대로)\n" +
                "It's okay, it's okay 조금 다르면 어때?\n" +
                "이러쿵저러쿵 뭐래두 I love myself\n" +
                "Okay, okay (whoo) 나답게 다 okay\n" +
                "어때? 어때? 뭐래도 뭐 어때? (어때?)\n" +
                "Okay, okay 내 방식대로 할게 (할게)\n" +
                "뭐든 어때? 이렇게 다 나일 뿐야\n" +
                "이런 것두 저것두 다 하고 싶단 말야\n" +
                "딱 하나만 하는 건 참 어려운걸\n" +
                "삐끗한대도 좋아, 뭐래도 나는 말야\n" +
                "내가 참 좋단 말야\n" +
                "Tap, tap, tap, tap 이런 말들과\n" +
                "Tap, tap, tap, tap 저런 말 사이에\n" +
                "상냥한 말 한 모금, 다시 또 귀가 쫑긋\n" +
                "힘이 샘솟는걸\n" +
                "내 맘을 검색해 정답을 찾아볼래\n" +
                "내가 정한 내 모습들로 (내 맘대로)\n" +
                "It's okay, it's okay 조금 다르면 어때?\n" +
                "그대로여도 괜찮아\n" +
                "오늘 나의 틈도, 내일 나의 꿈도\n" +
                "솔직히 말하면 (사랑받고 싶단 말야)\n" +
                "두드려줘 너의 마음을 톡톡\n" +
                "보여달란 말야\n" +
                "내 맘을 검색해 날 좀 알아봐 줄래?\n" +
                "전해줄 진심이 있는걸 (tap me, tap me)\n" +
                "It's okay, it's okay 조금 다르면 어때?\n" +
                "한 칸씩, 두 칸씩 니 맘의 꼭대기로\n" +
                "Okay, okay 우리답게 okay\n" +
                "어때? 어때? 뭐래도 뭐 어때?\n" +
                "Okay, okay 가보자, 뭐 어때?\n" +
                "뭐든 어때? 이런 게 우리잖아"
    ),
)